app/Controllers/Admin.php

SELECT *
FROM `pesanan`
WHERE `id_pesanan` = '1025'
UPDATE `pesanan` SET `poin_didapat` = 150
WHERE `id_pesanan` = '1025'
---
    public function verifikasi_bayar($idPesanan)
    {
        $pesananModel = new \App\Models\PesananModel();

        // Ubah status dari 'belum_bayar' menjadi 'pending' (agar masuk ke layar KDS Dapur)
        $pesananModel->updateStatus($idPesanan, 'pending');

        // =========================================================
        // TRIGGER ALGORITMA RFM & GAMIFIKASI SETELAH BAYAR
        // =========================================================
        $db = \Config\Database::connect();
        $pesanan = $db->table('pesanan')->where('id_pesanan', $idPesanan)->get()->getRowArray();

        $pesanTambahan = "";
        if ($pesanan && $pesanan['id_pelanggan'] != 1) { // Bukan Guest
            $rfmModel = new \App\Models\RfmModel();
            $tambahanPoin = $rfmModel->hitungDanUpdatePoin($pesanan['id_pelanggan']);

            if ($tambahanPoin > 0) {
                // Simpan poin yang didapat ke transaksi ini
                $db->table('pesanan')
                   ->where('id_pesanan', $idPesanan)
                   ->update(['poin_didapat' => $tambahanPoin]);