app/Controllers/Admin.php

    public function map_meja()
    {
        $pesananModel = new \App\Models\PesananModel();

        // Ambil pesanan yang masih aktif (belum_bayar atau pending)
        $db = \Config\Database::connect();
        $mejaAktif = $db->table('pesanan')
                        ->select('no_meja')
                        ->whereIn('status_pesanan', ['belum_bayar', 'pending'])
                        ->groupBy('no_meja')
                        ->get()->getResultArray();
---
SELECT `no_meja`
FROM `pesanan`
WHERE `status_pesanan` IN ('belum_bayar','pending')
GROUP BY `no_meja`