app/Controllers/Auth.php

    public function proses_login()
    {
        $pelangganModel = new PelangganModel();

        $email = $this->request->getPost('email');
        $pass  = $this->request->getPost('password');

        // 1. Cari data pelanggan berdasarkan email
        $user = $pelangganModel->where('email', $email)->first();
---
SELECT *
FROM `pelanggan`
WHERE `email` = 'dharmamahesa18@gmail.com'
 LIMIT 1

                    $spinChances++; // Free daily spin

                    // Update DB
                    $pelangganModel->update($user['id_pelanggan'], [
                        'last_login_date' => $today,
                        'streak_count'    => $streakCount,
                        'spin_chances'    => $spinChances
                    ]);
---
UPDATE `pelanggan` SET `last_login_date` = '2026-05-21', `streak_count` = 1, `spin_chances` = 3
WHERE `pelanggan`.`id_pelanggan` IN ('2')