app/Controllers/Checkout.php

SELECT *
FROM `voucher_global`
WHERE `kode_voucher` = '100K'
AND `status` = 'aktif'
---
    public function cek_voucher()
    {
        $json = $this->request->getJSON();
        $kode = $json->kode ?? '';
        $cart = $json->cart ?? [];
        $idPelanggan = session()->get('id_pelanggan');

        if(empty($kode) || !$idPelanggan) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Kode voucher tidak valid.']);
        }

        $db = \Config\Database::connect();

        // 1. Cek di tabel voucher_global (Promo Admin)
        $voucherGlobal = $db->table('voucher_global')
            ->where('kode_voucher', $kode)
            ->where('status', 'aktif')
            ->get()->getRowArray();