app/Controllers/MenuAdmin.php

SELECT *
FROM `menu`
ORDER BY `kategori` ASC
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen Menu - Toko Kopi Jaya Lestari',
            'menu'  => $this->menuModel->orderBy('kategori', 'ASC')->findAll()