app/Controllers/MisiAdmin.php

    public function index()
    {
        $db = \Config\Database::connect();
        $misi = $db->table('misi')->get()->getResultArray();
---
SELECT *
FROM `misi`