app/Controllers/Pelanggan.php


        // Ambil data voucher pelanggan
        $db = \Config\Database::connect();
        $voucher = $db->table('pelanggan_voucher')
            ->where('id_pelanggan', $idPelanggan)
            ->orderBy('status', 'ASC')
            ->orderBy('created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `pelanggan_voucher`
WHERE `id_pelanggan` = '2'
ORDER BY `status` ASC, `created_at` DESC