app/Controllers/Pelanggan.php

    public function profil()
    {
        $pelangganModel = new PelangganModel();

        // Ambil ID dari session yang sedang login
        $idPelanggan = session()->get('id_pelanggan');

        // Tarik data profil dari database
        $user = $pelangganModel->find($idPelanggan);
---
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`id_pelanggan` = '2'

    public function pesanan_saya()
    {
        $idPelanggan = session()->get('id_pelanggan');
        $db = \Config\Database::connect();

        $pesanan = $db->table('pesanan')
            ->where('id_pelanggan', $idPelanggan)
            ->orderBy('tgl_pesanan', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `pesanan`
WHERE `id_pelanggan` = '2'
ORDER BY `tgl_pesanan` DESC

    public function lucky_spin()
    {
        $idPelanggan = session()->get('id_pelanggan');
        $pelangganModel = new PelangganModel();

        $user = $pelangganModel->find($idPelanggan);

        // Ambil konfigurasi hadiah dari database (hanya yang aktif)
        $db    = \Config\Database::connect();
        $this->ensureSpinTable($db);
        $hadiah = $db->table('spin_hadiah')
                     ->where('is_active', 1)
                     ->orderBy('urutan', 'ASC')
                     ->get()->getResultArray();
---
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`id_pelanggan` = '2'
SELECT *
FROM `spin_hadiah`
WHERE `is_active` = 1
ORDER BY `urutan` ASC

    public function beli_spin()
    {
        $idPelanggan = session()->get('id_pelanggan');
        $pelangganModel = new PelangganModel();
        $user = $pelangganModel->find($idPelanggan);

        // 1 chance = 50 points
        if ($user['poin_loyalitas'] >= 50) {
            $pelangganModel->update($idPelanggan, [
                'poin_loyalitas' => $user['poin_loyalitas'] - 50,
                'spin_chances'   => $user['spin_chances'] + 1
            ]);
---
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`id_pelanggan` = '2'
UPDATE `pelanggan` SET `poin_loyalitas` = 2500, `spin_chances` = 1
WHERE `pelanggan`.`id_pelanggan` IN ('2')