app/Controllers/VoucherAdmin.php

SELECT *
FROM `voucher_global`
SELECT *
FROM `menu`
ORDER BY `nama_item` ASC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $voucher = $db->table('voucher_global')->get()->getResultArray();
        $menuList = $db->table('menu')->orderBy('nama_item', 'ASC')->get()->getResultArray();