app/Models/MenuModel.php

    public function getMenuByKategori($kategori)
    {
        return $this->where('kategori', $kategori)->findAll();
---
SELECT *
FROM `menu`
WHERE `kategori` = 'makanan'