app/Models/PesananModel.php

    public function simpanPesanan($dataPesanan, $dataDetail)
    {
        $db = \Config\Database::connect();
        $db->transStart();

        try {
            // Insert Header
            $db->table('pesanan')->insert($dataPesanan);
            $idPesanan = $db->insertID();

            // Sisipkan ID ke Detail
            foreach ($dataDetail as &$detail) {
                $detail['id_pesanan'] = $idPesanan;
            }

            // Insert Batch Detail
            $db->table('detail_pesanan')->insertBatch($dataDetail);
---
INSERT INTO `pesanan` (`id_pelanggan`, `tgl_pesanan`, `total_bayar`, `metode_bayar`, `status_pesanan`, `no_meja`) VALUES ('2', '2026-04-28 14:36:45', 35000, 'Cash', 'belum_bayar', '12')
INSERT INTO `pesanan` (`id_pelanggan`, `tgl_pesanan`, `total_bayar`, `metode_bayar`, `status_pesanan`, `no_meja`) VALUES (1, '2026-04-09 06:48:51', 75000, 'qris', 'pending', '5')
INSERT INTO `detail_pesanan` (`id_menu`, `id_pesanan`, `jumlah`, `subtotal`)
VALUES (4,10,1,35000)

    public function getPesananBelumBayar()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('pesanan');
        $builder->select('pesanan.*, pelanggan.nama_pelanggan');
        $builder->join('pelanggan', 'pelanggan.id_pelanggan = pesanan.id_pelanggan', 'left');
        $builder->where('pesanan.status_pesanan', 'belum_bayar');
        $builder->orderBy('pesanan.tgl_pesanan', 'ASC');
        $pesanan = $builder->get()->getResultArray();
---
SELECT `pesanan`.*, `pelanggan`.`nama_pelanggan`
FROM `pesanan`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pesanan`.`id_pelanggan`
WHERE `pesanan`.`status_pesanan` = 'belum_bayar'
ORDER BY `pesanan`.`tgl_pesanan` ASC

    public function getPesananPending()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('pesanan');
        $builder->select('pesanan.*, pelanggan.nama_pelanggan');
        $builder->join('pelanggan', 'pelanggan.id_pelanggan = pesanan.id_pelanggan', 'left');
        $builder->where('pesanan.status_pesanan', 'pending');
        $builder->orderBy('pesanan.tgl_pesanan', 'ASC');
        $pesanan = $builder->get()->getResultArray();

        foreach ($pesanan as &$p) {
            $p['detail'] = $db->table('detail_pesanan')
                              ->select('detail_pesanan.*, menu.nama_item')
                              ->join('menu', 'menu.id_menu = detail_pesanan.id_menu', 'left')
                              ->where('id_pesanan', $p['id_pesanan'])
                              ->get()->getResultArray();
---
SELECT `pesanan`.*, `pelanggan`.`nama_pelanggan`
FROM `pesanan`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pesanan`.`id_pelanggan`
WHERE `pesanan`.`status_pesanan` = 'pending'
ORDER BY `pesanan`.`tgl_pesanan` ASC
SELECT `detail_pesanan`.*, `menu`.`nama_item`
FROM `detail_pesanan`
LEFT JOIN `menu` ON `menu`.`id_menu` = `detail_pesanan`.`id_menu`
WHERE `id_pesanan` = '10'

    public function updateStatus($idPesanan, $statusBaru)
    {
        return $this->db->table('pesanan')
                        ->where('id_pesanan', $idPesanan)
                        ->update(['status_pesanan' => $statusBaru]);
---
UPDATE `pesanan` SET `status_pesanan` = 'pending'
WHERE `id_pesanan` = '1025'

    public function getPesananTerbaru($limit = 5)
    {
        $db = \Config\Database::connect();
        return $db->table('pesanan')
                  ->select('pesanan.*, pelanggan.nama_pelanggan')
                  ->join('pelanggan', 'pelanggan.id_pelanggan = pesanan.id_pelanggan', 'left')
                  ->orderBy('pesanan.tgl_pesanan', 'DESC')
                  ->limit($limit)
                  ->get()->getResultArray();
---
SELECT `pesanan`.*, `pelanggan`.`nama_pelanggan`
FROM `pesanan`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pesanan`.`id_pelanggan`
ORDER BY `pesanan`.`tgl_pesanan` DESC
 LIMIT 5

    public function getRiwayatSelesai($startDate = null, $endDate = null)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pesanan')
                  ->select('pesanan.*, pelanggan.nama_pelanggan')
                  ->join('pelanggan', 'pelanggan.id_pelanggan = pesanan.id_pelanggan', 'left')
                  ->whereIn('pesanan.status_pesanan', ['selesai', 'refund']);

        if ($startDate && $endDate) {
            $builder->where('DATE(pesanan.tgl_pesanan) >=', $startDate)
                    ->where('DATE(pesanan.tgl_pesanan) <=', $endDate);
        }

        return $builder->orderBy('pesanan.tgl_pesanan', 'DESC')
                  ->get()->getResultArray();
---
SELECT `pesanan`.*, `pelanggan`.`nama_pelanggan`
FROM `pesanan`
LEFT JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `pesanan`.`id_pelanggan`
WHERE `pesanan`.`status_pesanan` IN ('selesai','refund')
ORDER BY `pesanan`.`tgl_pesanan` DESC